system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


vertices
(
    (-0.15 -0.2 -0.005)
    (0.1 -0.2 -0.005)
    (0.1 1 -0.005)
    (-0.15 1 -0.005)
    (-0.15 -0.2 0.005)
    (0.1 -0.2 0.005)
    (0.1 1 0.005)
    (-0.15 1 0.005)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 30 1) simpleGrading (1 1 1)
);
//(100 80 60)
//(120 80 60)
//(100 80 100) better axel
edges
(
);

boundary
(
    
);

// ************************************************************************* //
